Revit 2026 API

# GradientGradientNoiseSmooth Property

---

The property labeled "Smooth" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientNoiseSmooth { get; }
```
```vb
Public Shared ReadOnly Property GradientNoiseSmooth As String
	Get
```
```cpp
public:
static property String^ GradientNoiseSmooth {
	String^ get ();
}
```
```fsharp
static member GradientNoiseSmooth : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace